<h2>ยินดีต้อนรับ</h2>

<p>
Smart Inventory คือ แอปพลิเคชั่น ที่พัฒนาขึ้นบนเว็บ หรือที่เราเรียกกันว่า เว็บแอปพลิเคชั่น ซึ่งในเอกสารนี่จะเรียก Smart Inventory สั้นๆ ว่า SI  <br>
SI  ถูกพัฒนาขึ้นมาเพื่อใช้ในการบริหารจัดการคลังสินค้าและการขายในแบบ Bussiness to bussiness (ผู้ผลิต กับ ตัวแทนขาย) ซึ่งระบบได้แบ่งการทำงานเป็น 3 ส่วนหลัก ได้แก่ Back-end, Front-end และ Sale-page <br><br>
ในส่วนแรกคือส่วนของ Back-end จะเป็นในเรื่องของการบริหารจัดการคลังสินค้าและการจัดการคำสั่งซื้อต่างๆ เช่น การรับสินค้าเข้าคลัง, การจัดเตรียมสินค้า, การตรวจสินค้า, การรับคำสั่งซื้อจากลูกค้า รวมถึงการกำหนด Master ต่างๆก็จะอยู่ในส่วนของ Back-end ซึ่งการเข้าถึงแต่ละเมนูจะถูกจัดการโดยการกำหนดสิทธิ์การเข้าถึง <br><br>
ส่วนที่สอง คือส่วนของ Front-end คือส่วนที่มีไว้สำหรับอำนวยความสะดวกในการสั่งสินค้าของลูกค้า โดยส่วนนี้จะอณุญาติให้ลูกค้า (ตัวแทนจำหน่าย ที่ลงทะเบียนไว้) สามารถ Login เข้ามาเพื่อสั่งสินค้าได้เองโดยไม่ต้องผ่านพนักงานขาย ซึ่งในส่วนนี้จะมีหน้าตาและการทำงานเหมือนกับเว็บไซต์ E-commerce ทัวไป โดยข้อมูลสินค้าจะถูกปรับปรุงทันที่เมื่อมีการปรับปรุงข้อมูลในส่วนของ Back-end <br><br>
ส่วนที่สาม คือ Sale-page เป็นเครื่องมือในการขายของพนักงานขาย โดยพนักงานขายจะสามารถสั่งซื้อสินค้าให้ลูกค้าและเห็นสต็อกคงเหลือของสินค้า ซึ่งหน้าตาของ Sale-page จะคล้ายกับ Front-end แต่จะมีเครื่องมือสำหรับพนักงานขาย เช่น การติดตามสถานะของคำสั่งซื้อ, รายงานยอดขาย เป็นต้น
</p>


<h2>Smart Inventory Work Flow Chart</h2>
<table width="100%" border="0px">
<tr><td width="50%" align="center"><h3>ภายใน</h3></td><td width="50%" align="center"><h3>ภายนอก</h3></td></tr>
<tr><td colspan="2" align="center"><img alt="Smart Inventory Work Flow Chart" src="images/flow.png" style="width:80%" /></td></tr>
</table>
